/*
클래스 : 변수와 함수를 하나로 묶어서 자료형을 정의 할 수 있는 문법적 요소(변수 + 함수)
C++에서는 구조체도 클래스의 범주에 들어가며, 클래스의 변수는 변수라고 하지 않고 객체라고
불리운다. 그럼 왜 클래스란 개념이 생겨났는가?

클래스를 설명 하기 앞서서 잠깐 객체지향을 언급해야 겠는데 객체지향이란 프로그램을 구현하는데 있어서
현실세계를 그대로 모델링 해서 이것을 그대로 프로그래밍으로 옮겼으면 좋겠다는 생각을 모티브로 
나온 것 이다. 바로 현실세계에 존재하는 대상을 가지고, 자료형으로 정의 하는 것이다. 하지만 현실세께
의 사물들을 자료형으로 정의하기 위해서는 데이터 추상화가 필요한데, 데이터 추상화란 현실세계의 사물을
데이터적인 측면과 기능적인 측면을 통해서 정의 한 것이라고 할 수 있다.

이런 데이터 추상화를 거쳐서 클래스화 되고 인스턴스화(객체화)가 일어난다.

그럼 왜 클래스는 함수와 변수로 표현해야 될까?
현실세계에 존재하는 대상을 추상화 하다 보면, 데이터적 특성도 있지만, 기능적인 측면이 있기 때문에,
함수 변수 이 두개를 하나의 자료형으로 묶는 것이다. 이것이 바로 클래스 이다.
*/